{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_30", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_41"}, "name": "input_41", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_272", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_272", "inbound_nodes": [[["input_41", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_280", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_280", "inbound_nodes": [[["conv2d_272", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_62", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_62", "inbound_nodes": [[["instance_normalization_280", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_273", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_273", "inbound_nodes": [[["re_lu_62", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_281", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_281", "inbound_nodes": [[["conv2d_273", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_88", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_88", "inbound_nodes": [[["instance_normalization_281", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_274", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_274", "inbound_nodes": [[["activation_88", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_282", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_282", "inbound_nodes": [[["conv2d_274", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_89", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_89", "inbound_nodes": [[["instance_normalization_282", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_275", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 20}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_275", "inbound_nodes": [[["activation_89", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_283", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_283", "inbound_nodes": [[["conv2d_275", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_90", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_90", "inbound_nodes": [[["instance_normalization_283", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_276", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 20}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_276", "inbound_nodes": [[["activation_90", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_284", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_284", "inbound_nodes": [[["conv2d_276", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_90", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_90", "inbound_nodes": [[["instance_normalization_284", 0, 0, {}], ["activation_89", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_277", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 33}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_277", "inbound_nodes": [[["concatenate_90", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_285", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_285", "inbound_nodes": [[["conv2d_277", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_91", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_91", "inbound_nodes": [[["instance_normalization_285", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_278", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 33}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_278", "inbound_nodes": [[["activation_91", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_286", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_286", "inbound_nodes": [[["conv2d_278", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_91", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_91", "inbound_nodes": [[["instance_normalization_286", 0, 0, {}], ["concatenate_90", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_279", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 46}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_279", "inbound_nodes": [[["concatenate_91", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_287", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_287", "inbound_nodes": [[["conv2d_279", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_92", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_92", "inbound_nodes": [[["instance_normalization_287", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_280", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 46}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_280", "inbound_nodes": [[["activation_92", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_288", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_288", "inbound_nodes": [[["conv2d_280", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_92", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_92", "inbound_nodes": [[["instance_normalization_288", 0, 0, {}], ["concatenate_91", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_281", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 59}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_281", "inbound_nodes": [[["concatenate_92", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_289", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_289", "inbound_nodes": [[["conv2d_281", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_93", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_93", "inbound_nodes": [[["instance_normalization_289", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_282", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 59}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_282", "inbound_nodes": [[["activation_93", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_290", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_290", "inbound_nodes": [[["conv2d_282", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_93", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_93", "inbound_nodes": [[["instance_normalization_290", 0, 0, {}], ["concatenate_92", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_283", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 72}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_283", "inbound_nodes": [[["concatenate_93", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_291", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_291", "inbound_nodes": [[["conv2d_283", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_94", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_94", "inbound_nodes": [[["instance_normalization_291", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_284", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 72}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_284", "inbound_nodes": [[["activation_94", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_292", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_292", "inbound_nodes": [[["conv2d_284", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_94", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_94", "inbound_nodes": [[["instance_normalization_292", 0, 0, {}], ["concatenate_93", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_285", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 85}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_285", "inbound_nodes": [[["concatenate_94", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_293", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_293", "inbound_nodes": [[["conv2d_285", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_95", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_95", "inbound_nodes": [[["instance_normalization_293", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_286", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 85}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_286", "inbound_nodes": [[["activation_95", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_294", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_294", "inbound_nodes": [[["conv2d_286", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_95", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_95", "inbound_nodes": [[["instance_normalization_294", 0, 0, {}], ["concatenate_94", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_287", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 98}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_287", "inbound_nodes": [[["concatenate_95", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_295", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_295", "inbound_nodes": [[["conv2d_287", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_96", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_96", "inbound_nodes": [[["instance_normalization_295", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_288", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 98}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_288", "inbound_nodes": [[["activation_96", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_296", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_296", "inbound_nodes": [[["conv2d_288", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_96", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_96", "inbound_nodes": [[["instance_normalization_296", 0, 0, {}], ["concatenate_95", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_289", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 111}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_289", "inbound_nodes": [[["concatenate_96", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_297", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_297", "inbound_nodes": [[["conv2d_289", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_97", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_97", "inbound_nodes": [[["instance_normalization_297", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_290", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 111}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_290", "inbound_nodes": [[["activation_97", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_298", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_298", "inbound_nodes": [[["conv2d_290", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_97", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_97", "inbound_nodes": [[["instance_normalization_298", 0, 0, {}], ["concatenate_96", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_291", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 124}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_291", "inbound_nodes": [[["concatenate_97", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_299", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_299", "inbound_nodes": [[["conv2d_291", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_98", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_98", "inbound_nodes": [[["instance_normalization_299", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_292", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 124}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_292", "inbound_nodes": [[["activation_98", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_300", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_300", "inbound_nodes": [[["conv2d_292", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_98", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_98", "inbound_nodes": [[["instance_normalization_300", 0, 0, {}], ["concatenate_97", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_28", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_28", "inbound_nodes": [[["concatenate_98", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_301", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_301", "inbound_nodes": [[["conv2d_transpose_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_99", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_99", "inbound_nodes": [[["instance_normalization_301", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_29", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_29", "inbound_nodes": [[["activation_99", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_302", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_302", "inbound_nodes": [[["conv2d_transpose_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_100", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_100", "inbound_nodes": [[["instance_normalization_302", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_293", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_293", "inbound_nodes": [[["activation_100", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_303", "trainable": true, "dtype": "float32", "axis": -1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "instance_normalization_303", "inbound_nodes": [[["conv2d_293", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_101", "trainable": true, "dtype": "float32", "activation": "tanh"}, "name": "activation_101", "inbound_nodes": [[["instance_normalization_303", 0, 0, {}]]]}], "input_layers": [["input_41", 0, 0]], "output_layers": [["activation_101", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of34.bin", "group1-shard2of34.bin", "group1-shard3of34.bin", "group1-shard4of34.bin", "group1-shard5of34.bin", "group1-shard6of34.bin", "group1-shard7of34.bin", "group1-shard8of34.bin", "group1-shard9of34.bin", "group1-shard10of34.bin", "group1-shard11of34.bin", "group1-shard12of34.bin", "group1-shard13of34.bin", "group1-shard14of34.bin", "group1-shard15of34.bin", "group1-shard16of34.bin", "group1-shard17of34.bin", "group1-shard18of34.bin", "group1-shard19of34.bin", "group1-shard20of34.bin", "group1-shard21of34.bin", "group1-shard22of34.bin", "group1-shard23of34.bin", "group1-shard24of34.bin", "group1-shard25of34.bin", "group1-shard26of34.bin", "group1-shard27of34.bin", "group1-shard28of34.bin", "group1-shard29of34.bin", "group1-shard30of34.bin", "group1-shard31of34.bin", "group1-shard32of34.bin", "group1-shard33of34.bin", "group1-shard34of34.bin"], "weights": [{"name": "conv2d_272/kernel", "shape": [7, 7, 3, 64], "dtype": "float32"}, {"name": "conv2d_272/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_273/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_273/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_274/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_274/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_275/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_275/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_276/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_276/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_277/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "conv2d_277/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_278/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_278/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_279/kernel", "shape": [3, 3, 768, 256], "dtype": "float32"}, {"name": "conv2d_279/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_280/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_280/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_281/kernel", "shape": [3, 3, 1024, 256], "dtype": "float32"}, {"name": "conv2d_281/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_282/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_282/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_283/kernel", "shape": [3, 3, 1280, 256], "dtype": "float32"}, {"name": "conv2d_283/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_284/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_284/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_285/kernel", "shape": [3, 3, 1536, 256], "dtype": "float32"}, {"name": "conv2d_285/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_286/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_286/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_287/kernel", "shape": [3, 3, 1792, 256], "dtype": "float32"}, {"name": "conv2d_287/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_288/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_288/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_289/kernel", "shape": [3, 3, 2048, 256], "dtype": "float32"}, {"name": "conv2d_289/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_290/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_290/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_291/kernel", "shape": [3, 3, 2304, 256], "dtype": "float32"}, {"name": "conv2d_291/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_292/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_292/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_293/kernel", "shape": [7, 7, 64, 3], "dtype": "float32"}, {"name": "conv2d_293/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_transpose_28/kernel", "shape": [3, 3, 128, 2560], "dtype": "float32"}, {"name": "conv2d_transpose_28/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_29/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_transpose_29/bias", "shape": [64], "dtype": "float32"}, {"name": "instance_normalization_280/gamma", "shape": [64], "dtype": "float32"}, {"name": "instance_normalization_280/beta", "shape": [64], "dtype": "float32"}, {"name": "instance_normalization_281/gamma", "shape": [128], "dtype": "float32"}, {"name": "instance_normalization_281/beta", "shape": [128], "dtype": "float32"}, {"name": "instance_normalization_282/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_282/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_283/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_283/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_284/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_284/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_285/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_285/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_286/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_286/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_287/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_287/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_288/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_288/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_289/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_289/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_290/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_290/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_291/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_291/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_292/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_292/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_293/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_293/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_294/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_294/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_295/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_295/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_296/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_296/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_297/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_297/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_298/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_298/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_299/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_299/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_300/gamma", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_300/beta", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_301/gamma", "shape": [128], "dtype": "float32"}, {"name": "instance_normalization_301/beta", "shape": [128], "dtype": "float32"}, {"name": "instance_normalization_302/gamma", "shape": [64], "dtype": "float32"}, {"name": "instance_normalization_302/beta", "shape": [64], "dtype": "float32"}, {"name": "instance_normalization_303/gamma", "shape": [3], "dtype": "float32"}, {"name": "instance_normalization_303/beta", "shape": [3], "dtype": "float32"}]}]}